package android_serialport_api

/**
 * 作者　　: 李坤
 * 创建时间: 2023/8/22　11:09
 * 邮箱　　：496546144@qq.com
 *
 * 功能介绍：
 */
/**
 * 常用串口波特率
 */
enum class BAUDRATE(val baudrate: Int) {
    B0(0),
    B50(50),
    B75(75),
    B110(110),
    B134(134),
    B150(150),
    B200(200),
    B300(300),
    B600(600),
    B1200(1200),
    B1800(1800),
    B2400(2400),
    B4800(4800),
    B9600(9600),
    B19200(19200),
    B38400(38400),
    B57600(57600),
    B115200(115200),
    B230400(230400),
    B460800(460800),
    B500000(500000),
    B576000(576000),
    B921600(921600),
    B1000000(1000000),
    B1152000(1152000),
    B1500000(1500000),
    B2000000(2000000),
    B2500000(2500000),
    B3000000(3000000),
    B3500000(3500000),
    B4000000(4000000);

}

/**
 * 串行端口停止位
 */
enum class STOPB(val stopBit: Int) {
    B1(1), B2(2);

}

/**
 * 串行端口数据位
 */
enum class DATAB(val dataBit: Int) {
    CS5(5), CS6(6), CS7(7), CS8(8);

}

/**
 * 串行端口奇偶校验
 */
enum class PARITY(val parity: Int) {
    NONE(0), ODD(1), EVEN(2), SPACE(3), MARK(4);

}

/**
 * 串行端口流量类型
 */
enum class FLOWCON(var flowCon: Int) {
    NONE(0), HARD(1), SOFT(2);

}